{
  "format": "layers-model",
  "generatedBy": "keras v2.7.0",
  "convertedBy": "TensorFlow.js Converter v3.13.0",
  "modelTopology": {
    "keras_version": "2.7.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                4
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "dense_1_input"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "batch_input_shape": [
                null,
                4
              ],
              "dtype": "float32",
              "units": 6,
              "activation": "tanh",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 3,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "categorical_crossentropy",
      "metrics": null,
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "SGD",
        "config": {
          "name": "SGD",
          "learning_rate": 0.009999999776482582,
          "decay": 0,
          "momentum": 0.8999999761581421,
          "nesterov": true
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense_1/kernel",
          "shape": [
            4,
            6
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": 6,
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            6,
            3
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": 3,
          "dtype": "float32"
        }
      ]
    }
  ]
}
